# Задача №29. Решение в группах
# Ваня и Петя поспорили, кто быстрее решит
# следующую задачу: “Задана последовательность
# неотрицательных целых чисел. Требуется определить
# значение наибольшего элемента
# последовательности, которая завершается первым
# встретившимся нулем (число 0 не входит в
# последовательность)”. Однако 2 друга оказались не
# такими смышлеными. Никто из ребят не смог до
# конца сделать это задание. Они решили так: у кого
# будет меньше ошибок в коде, тот и выиграл спор. За
# помощью товарищи обратились к Вам, студентам.

# # Ваня:
# n = int(input())
# max_number = 1000 # должно быть n
# while n != 0:
#     n = int(input())
#     if max_number > n: # max_number < n
#         max_number = n
# print(max_number)

# # Петя:
# n = int(input())
# max_number = -1 # должно быть n
# while n < 0: # должно быть while n != 0:
#     n = int(input())
#     if max_number < n:
#         n = max_number # должно быть max_number = n
# print(n) # должно быть print(max_number)

# правильный код
n = int(input())
max_number = n
while n != 0:
    n = int(input())
    if max_number < n:
        max_number = n
print(max_number)