# Семинар 1. Ввод-вывод, операторы ветвления
# Задача №1. Решение в группах
# За день машина проезжает n километров.
# Сколько дней нужно, чтобы проехать маршрут длиной m километров?
# При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.
import math

n = int(input("Введите сколько машина проезжает километров в день: "))
m = int(input("Введите длину маршрута в километрах: "))

t = (m+n-1)//n
# t = m/n + (m/n) % n
# t = math.ceil(m/n)
# t = round(m/n,2)

print(f"Количество дней, необходимое чтобы проехать маршрут: {t}")