# Задача №39. Решение в группах
# Даны два массива чисел. Требуется вывести те элементы
# первого массива (в том порядке, в каком они идут в первом
# массиве), которых нет во втором массиве. Пользователь вводит
# число N - количество элементов в первом массиве, затем N
# чисел - элементы массива. Затем число M - количество
# элементов во втором массиве. Затем элементы второго массива
# Ввод:              Вывод:
# 7                  3 3 2 12
# 3 1 3 4 2 4 12
# 6
# 4 15 43 1 15 1

n = int(input('Введите кол-во элементов первого массива: '))

print('Введите элементы первого массива через пробел')
list1 = [int(i) for i in input().split()[:n]]

m = int(input('Введите кол-во элементов второго массива: '))

print('Введите элементы первого массива через пробел')
list2 = [int(i) for i in input().split()[:m]]
print(list2)

for i in list1:
    if i not in list2:
        print(i, end=' ')


# list1 = [int(input(f'Введите {i + 1}-е число: '))
#          for i in range(int(input('Введите количество элементов первого массива: ')))]
# list2 = [int(input(f'Введите {j + 1}-е число: '))
#          for j in range(int(input('Введите количество элементов второго массива: ')))]
# new_list = [el if el not in list2 else 0 for el in list1]
# print(new_list)