# Задача №41. Решение в группах
# Дан массив, состоящий из целых чисел. Напишите
# программу, которая в данном массиве определит
# количество элементов, у которых есть два соседних и, при
# этом, оба соседних элемента меньше данного. Сначала
# вводится число N — количество элементов в массиве
# Далее записаны N чисел — элементы массива. Массив
# состоит из целых чисел.

n = int(input('Введите кол-во элементов первого массива: '))

print('Введите элементы первого массива через пробел')
list1 = [int(i) for i in input().split()[:n]]

counter = 0
for i in range(1, n - 1):
    if list1[i - 1] < list1[i] > list1[i + 1]:
        counter += 1

print(counter)