# Задача №43. Решение в группах
# Дан список чисел. Посчитайте, сколько в нем пар
# элементов, равных друг другу. Считается, что любые
# два элемента, равные друг другу образуют одну пару,
# которую необходимо посчитать. Вводится список
# чисел. Все числа списка находятся на разных
# строках.

print('Введите элементы первого массива через пробел')
list1 = [int(i) for i in input().split()[:]]

counter = 0
for i in list1:
    for j in list1:
        if i == j:
            counter += 1
print((counter - len(list1)) // 2)