# Дано натуральное число N и
# последовательность из N элементов.
# Требуется вывести эту последовательность в
# обратном порядке.
# Примечание. В программе запрещается
# объявлять массивы и использовать циклы
# (даже для ввода и вывода).
# Input: 2 -> 3 4
# Output: 4 3

def print_numbers(n):
    if n > 0:
        numb = input('Введите число: ')
        print_numbers(n-1)
        print(numb, end=' ')
    else:
        print('Чиcла в обратном порядке')

N = int(input('Введите количество элементов: '))

print_numbers(N)