# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?
# 6 -> 1 4 1
# 24 -> 4 16 4
# 60 -> 10 40 10

condition = False
while condition == False:
    cranes = int(input("Введите сколько журавликов сделали вместе Петя, Катя и Серёжа: "))

    cranes_ps = 0  # журавлики Пети или Серёжи
    cranes_k = 0  # журавлики Кати
    for i in range(cranes):
        cranes_ps = i+1
        cranes_k = (cranes_ps+cranes_ps)*2
        if cranes_ps*2+cranes_k == cranes:
            condition = True
            break
    if cranes_ps*2+cranes_k != cranes:
        print("Введённые данные не соответствуют условию задачи")

print(f"Петя сделал журавликов: {cranes_ps}")
print(f"Катя сделала журавликов: {cranes_k}")
print(f"Серёжа сделал журавликов: {cranes_ps}")